app/controllers/notes_controller.rb

  def index
    user_id = params[:user_id] || current_user.id
    @notes = Note.find(:all, :conditions => ["user_id = ?", user_id])
    @mobile = mobile_device?
    respond_to do |format|
      format.html # index.html.erb
      format.xml  { render :xml => @notes }
      format.json  {
        titles = {}
        @notes.each do |note|
---
SELECT * FROM "notes" WHERE (user_id = 3)
SELECT * FROM "notes"

  def show
    @note = Note.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1)

  def edit
    @note = Note.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1)

  def create
    @note = Note.new(params[:note])
    @note.user_id = current_user.id
    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("created_at", "title", "body", "updated_at", "user_id") VALUES('2009-06-08 06:21:48', 'Portable Papa', 'papa: 0689767040', '2009-06-08 06:21:48', 3)

  def update
    @note = Note.find(params[:id])

    respond_to do |format|
      if @note.update_attributes(params[:note])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1)
UPDATE "notes" SET "updated_at" = '2009-01-18 23:40:44', "body" = 'A controller/model/view generator for easily adding authentication, users, and logins to your rails app. Login generator has no dependencies.