app/controllers/tasks_controller.rb

  def index
    @tasks = Task.find(:all, :conditions => ["user_id = ?", current_user.id])
---
SELECT * FROM "tasks" WHERE ("tasks"."user_id" = 3) LIMIT 1

  def show
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 953125641)

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 953125641)

  def create
    @task = Task.new(params[:task])
    @task.user_id = current_user.id
    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "title", "priority_id", "updated_at", "done", "user_id") VALUES('2009-06-08 06:18:21', 'refaire cv et chercher du travail', 3, '2009-06-08 06:18:21', 'f', 3)

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 996332877)
UPDATE "tasks" SET "updated_at" = '2009-06-06 07:34:15', "title" = 'finish task and note application soon' WHERE "id" = 953125641

    task = Task.find(params[:id])
    task.update_attribute(:done, params[:done])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 953125641)
UPDATE "tasks" SET "updated_at" = '2009-05-31 05:33:09', "done" = 't' WHERE "id" = 953125641

    task = Task.find(params[:id])
    task.update_attribute(:priority_id, params[:priority_id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 953125641)
UPDATE "tasks" SET "updated_at" = '2009-06-06 22:04:43', "priority_id" = NULL WHERE "id" = 953125641